# CutMarkType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CutMarkType Class
Members See Also
---
An object represents the cut mark type in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class CutMarkType : ElementType
```

Visual Basic
---
```text
Public Class CutMarkType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class CutMarkType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Architecture..::..CutMarkType
# See Also
CutMarkType Members
Autodesk.Revit.DB.Architecture Namespace